{
  "version": 1,
  "fixed": {
    "01-01": {
      "id": "new-years-day",
      "title": "🎆 Nýársdagur",
      "summary": "Hin stóra endursetning, allt byrjar aftur frá grunni. Táknrænn dagur endurnýjunar og stórtæktra áramótaheita sem flest deyja fyrir lok janúar. Lögbundinn frídagur á Íslandi.",
      "body": "Nýársdagur markar upphaf nýs árs samkvæmt gregoríska tímatalinu og hefur lengi haft táknræna merkingu um endurnýjun, upphaf og samfélagslega samveru.\n\nDagurinn er lögbundinn almennur frídagur á Íslandi og hluti af hefðbundnu frídagakerfi sem mótaðist á 20. öld í tengslum við þróun vinnuréttar og skipulag vinnuviku.\n\nÞótt ekki liggi fyrir ein nákvæm lagagrein um „stofnun“ nýársdags sem frídags, hefur hann verið fastur hluti af lögbundnum frídögum í íslenskum rétti í áratugi og telst sjálfsagður frídagur í samfélaginu í dag.\n\nNýársdagur þjónar því bæði félagslegum og hagnýtum tilgangi sem hvíldardagur eftir áramótahátíðir og sameiginleg byrjun nýs starfsárs.",
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" },
        { "label": "Wikipedia (IS): Lögbundnir frídagar á Íslandi", "url": "https://is.wikipedia.org/wiki/L%C3%B6gbundnir_fr%C3%ADdagar_%C3%A1_%C3%8Dslandi" }
      ]
    },
    "01-06": {
      "id": "twelfth-night",
      "title": "✨ Þrettándinn",
      "summary": "Þrettándinn er opinber lokun jóla – álfunum er hent út, jólatréð fer í ruslið og landið kveikir í risastórum bálum til að fagna (eða hræða huldufólkið í burtu, hvorugt er alveg ljóst). Kristileg Epiphany blandast íslenskri þjóðtrú um galdra og galdrakarla. Merkisdagur en ekki frídagur – því miður, engin lögleg afsökun fyrir að sofa fram yfir hádegið.",
      "body": "Þrettándinn er haldinn 6. janúar og markar hefðbundið lok jólatímans.\n\nÍ kristinni hefð tengist dagurinn birtingu Krists (Epiphany) og „þrettánda degi jóla“. Á Íslandi hefur dagurinn einnig sterka þjóðtrúar- og menningarlega vídd, þar sem sögur um huldufólk og álfabrennur hafa verið lifandi.\n\nÞrettándinn er almennt talinn merkisdagur í íslenskri hefð (ekki lögbundinn almennur frídagur fyrir allt launafólk).",
      "sources": [
        { "label": "Wikipedia (IS): Þrettándinn", "url": "https://is.wikipedia.org/wiki/%C3%9Erett%C3%A1ndinn" }
      ]
    },
    "02-14": {
      "id": "valentines-day",
      "title": "💌 Valentínusardagurinn",
      "summary": "Dagurinn þegar allir verða skyndilega rómantískir og búðirnar selja rauðar rósir á verði sem gæti keypt bíl. Fullkominn til að sýna ást þína – eða minna maka þinn á að þú manst eftir honum einu sinni á ári.",
      "body": "Valentínusardagurinn er haldinn 14. febrúar og tengist í nútímahefð kveðjum, gjöfum og athöfnum sem snúa að ást og vináttu.\n\nDagurinn er víða haldinn hátíðlegur, en telst merkisdagur en ekki lögbundinn frídagur á Íslandi.",
      "sources": [
        { "label": "Wikipedia (IS): Valentínusardagur", "url": "https://is.wikipedia.org/wiki/Valent%C3%ADnusardagur" }
      ]
    },
    "05-01": {
      "id": "labour-day",
      "title": "✊ Verkalýðsdagurinn",
      "summary": "Alþjóðlegur baráttudagur verkafólks; á Íslandi með fyrstu kröfugöngu 1923 og formfest frídagakerfi 1972. Heiðrar samstöðu og baráttu verkafólks fyrir réttindum um 8 stunda vinnudag.",
      "body": "Alþjóðlegur baráttudagur verkafólks (May Day / Labour Day) sem á rætur sínar að rekja til vinnu- og verkfallsbaráttu í Bandaríkjunum á síðari hluta 19. aldar, einkum kröfunnar um 8 stunda vinnudag.\n\nÁ Íslandi fór fyrsta kröfugangan fram 1. maí 1923 í Reykjavík, þar sem verkalýðshreyfingin setti fram kröfur um bætt kjör og vinnuréttindi.\n\nÞrátt fyrir langa hefð kröfuganga og samkomna varð 1. maí ekki almennur lögbundinn frídagur fyrr en árið 1972, þegar frídagakerfi launafólks var formfest.\n\nÍ dag er 1. maí bæði lögbundinn frídagur og virkur baráttudagur þar sem kröfugöngur, fundir og félagsleg umræða um stöðu launafólks eru í forgrunni.",
      "sources": [
        { "label": "IWW Ísland: The First May 1st in Iceland (1923)", "url": "https://iwwisland.org/2021/05/03/the-first-may-1st-in-iceland-1923/" },
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" }
      ]
    },
    "06-17": {
      "id": "national-day",
      "title": "🇮🇸 Þjóðhátíðardagurinn",
      "summary": "Minnir á stofnun Lýðveldisins 1944 og er fæðingardagur Jóns Sigurðssonar.",
      "body": "17. júní er þjóðhátíðardagur Íslendinga og minnir á stofnun Lýðveldisins Íslands árið 1944, þegar sambandinu við Danmörku var formlega slitið.\n\nDagurinn var valinn vegna þess að hann er fæðingardagur Jóns Sigurðssonar (1811–1879), helsta leiðtoga sjálfstæðisbaráttu Íslendinga á 19. öld.\n\nÍ dag er 17. júní stærsti sameiginlegi hátíðisdagur þjóðarinnar, þar sem þjóðarsjálfstæði, saga og menningarleg sjálfsmynd eru í brennidepli.",
      "sources": [
        { "label": "Wikipedia: Icelandic National Day", "url": "https://en.wikipedia.org/wiki/Icelandic_National_Day" },
        { "label": "Vísindavefur HÍ: Af hverju er 17. júní þjóðhátíðardagur?", "url": "https://www.visindavefur.is/svar.php?id=1692" }
      ]
    },
    "10-11": {
      "id": "presidents-birthday-ht",
      "title": "🎂 Fæðingardagur forseta (HT)",
      "summary": "Merkisdagur tengdur sögu embættis forseta; ekki lögbundinn frídagur.",
      "body": "Dagurinn er stundum merktur í dagatölum sem merkisdagur.\n\nHann telst ekki til lögbundinna almennra frídaga.",
      "sources": []
    },
    "10-31": {
      "id": "halloween",
      "title": "🎃 Hrekkjavaka",
      "summary": "Dagur sem hefur orðið algengari á Íslandi síðustu áratugi. Börn í búningum ræna sælgæti – fullorðnir kaupa extra mikið „handa gestunum“ en éta það sjálfir.",
      "body": "Hrekkjavaka (Halloween) er 31. október og tengist búningum, skreytingum og leikjum.\n\nHún telst merkisdagur en ekki lögbundinn frídagur á Íslandi.",
      "sources": [
        { "label": "Wikipedia (IS): Hrekkjavaka", "url": "https://is.wikipedia.org/wiki/Hrekkjavaka" }
      ]
    },
    "11-16": {
      "id": "icelandic-language-day",
      "title": "📚 Dagur íslenskrar tungu",
      "summary": "Merkisdagur tileinkaður íslensku; haldinn á fæðingardegi Jónasar Hallgrímssonar. Við minnumst Jónasar og lofum málið en förum svo því miður aftur að nota enskaslettur í setningum.",
      "body": "Dagur íslenskrar tungu er haldinn 16. nóvember og er tileinkaður íslenskri tungu og menningararfi.\n\nDagurinn er valinn vegna þess að hann er fæðingardagur Jónasar Hallgrímssonar.",
      "sources": [
        { "label": "Wikipedia (IS): Dagur íslenskrar tungu", "url": "https://is.wikipedia.org/wiki/Dagur_%C3%ADslenskrar_tungu" }
      ]
    },
    "12-01": {
      "id": "sovereignty-day",
      "title": "🇮🇸 Fullveldisdagurinn",
      "summary": "Minnir á fullveldi Íslands 1918; merkisdagur (ekki lögbundinn almennur frídagur).",
      "body": "Fullveldisdagurinn 1. desember minnir á að Ísland varð fullvalda ríki árið 1918.\n\nDagurinn er almennt merktur sem merkisdagur, en er ekki lögbundinn almennur frídagur fyrir allt launafólk.",
      "sources": [
        { "label": "Wikipedia (IS): Fullveldi Íslands", "url": "https://is.wikipedia.org/wiki/Fullveldi_%C3%8Dslands" }
      ]
    },
    "12-23": {
      "id": "thorlaksmessa",
      "title": "🕯️ Þorláksmessa",
      "summary": "Merkisdagur 23. desember; tengist Þorláki helga og íslenskum jólaundirbúningi.",
      "body": "Þorláksmessa er 23. desember og hefur lengi verið mikilvægur dagur í íslenskum jólaundirbúningi.\n\nDagurinn tengist Þorláki helga og hefur einnig sterkar matarmenningarhefðir (t.d. kæst skata hjá mörgum).",
      "sources": [
        { "label": "Wikipedia (IS): Þorláksmessa", "url": "https://is.wikipedia.org/wiki/%C3%9Eorl%C3%A1ksmessa" }
      ]
    },
    "12-24": {
      "id": "christmas-eve",
      "title": "🕯️ Aðfangadagur",
      "summary": "Aðfangadagur jóla; helsti hátíðarkvöldverður og jólaathafnir. Hluti af lögbundnu frídagakerfi jóla.",
      "body": "Aðfangadagur er 24. desember og er eitt mikilvægasta kvöld ársins í íslenskri jólahefð.\n\nÁ kvöldinu eru jól haldin hátíðleg með samveru, máltíð, gjöfum og oft kirkjuathöfnum. Í raun upplifa margir Aðfangadag sem „aðal-jóladaginn“ í menningarlegum skilningi, þótt 25. desember sé formlegi jóladagurinn.\n\nAðfangadagur telst til lögbundinna frídaga í íslensku frídagakerfi jóla.",
      "sources": [
        { "label": "Wikipedia (IS): Lögbundnir frídagar á Íslandi", "url": "https://is.wikipedia.org/wiki/L%C3%B6gbundnir_fr%C3%ADdagar_%C3%A1_%C3%8Dslandi" },
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" }
      ]
    },
    "12-25": {
      "id": "christmas-day",
      "title": "🎄 Jóladagur",
      "summary": "Fyrsti dagur jóla; lögbundinn almennur frídagur.",
      "body": "Jóladagur, 25. desember, er fyrsti dagur jóla og einn af stærstu kirkju- og fjölskylduhátíðisdögum ársins.\n\nDagurinn er lögbundinn almennur frídagur á Íslandi og tengist bæði kristinni hefð og sterkri menningarhefð um samveru og hvíld yfir hátíðarnar.",
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" },
        { "label": "Wikipedia (IS): Lögbundnir frídagar á Íslandi", "url": "https://is.wikipedia.org/wiki/L%C3%B6gbundnir_fr%C3%ADdagar_%C3%A1_%C3%8Dslandi" }
      ]
    },
    "12-26": {
      "id": "second-day-of-christmas",
      "title": "🎄 Annar í jólum",
      "summary": "Annar dagur jóla; lögbundinn almennur frídagur.",
      "body": "Annar í jólum, 26. desember, er framhald jóladaga og hluti af lögbundnum frídagakerfi yfir jólahátíðina.\n\nDagurinn er nýttur til hvíldar og samveru og er almennur frídagur á Íslandi.",
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" },
        { "label": "Wikipedia (IS): Lögbundnir frídagar á Íslandi", "url": "https://is.wikipedia.org/wiki/L%C3%B6gbundnir_fr%C3%ADdagar_%C3%A1_%C3%8Dslandi" }
      ]
    },
    "12-31": {
      "id": "new-years-eve",
      "title": "🎇 Gamlársdagur",
      "summary": "Síðasti dagur ársins; Flugeldar, áramótaskaup og uppgjör ársins – vonandi betra ár framundan!",
      "body": "Gamlársdagur er 31. desember og markar lok ársins. Á Íslandi er dagurinn sterkt tengdur áramótahátíð, fjölskyldusamveru og hefðum um áramótabrennur og flugelda.\n\nÍ frídagakerfinu myndar hann ásamt nýársdegi samhangandi hátíðartíma um áramót.",
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" },
        { "label": "Wikipedia (IS): Lögbundnir frídagar á Íslandi", "url": "https://is.wikipedia.org/wiki/L%C3%B6gbundnir_fr%C3%ADdagar_%C3%A1_%C3%8Dslandi" }
      ]
    }
  },
  "rules": [
    {
      "id": "bondadagur",
      "title": "🧣 Bóndadagur, upphaf Þorra",
      "summary": "Fyrsti föstudagur á eða eftir 19. janúar (upphaf Þorra í hefðbundnu misseristali).",
      "body": "Bóndadagur markar upphaf Þorra í íslenskri hefð og er tengdur gömlum misserisskiptum.\n\nDagurinn er merkisdagur (ekki lögbundinn frídagur).",
      "rule": { "type": "weekdayOnOrAfter", "month": 1, "day": 19, "weekday": 5 },
      "sources": [
        { "label": "Wikipedia (IS): Þorri", "url": "https://is.wikipedia.org/wiki/%C3%9Eorri" }
      ]
    },
    {
      "id": "konudagur",
      "title": "🌸 Konudagur, upphaf Góu",
      "summary": "Fyrsti sunnudagur á eða eftir 18. febrúar (upphaf Góu í hefðbundnu misseristali).",
      "body": "Konudagur markar upphaf Góu í íslenskri hefð og er hluti af gömlum misserisskiptum.\n\nDagurinn er merkisdagur (ekki lögbundinn frídagur).",
      "rule": { "type": "weekdayOnOrAfter", "month": 2, "day": 18, "weekday": 0 },
      "sources": [
        { "label": "Wikipedia (IS): Góa", "url": "https://is.wikipedia.org/wiki/G%C3%B3a" }
      ]
    },
    {
      "id": "bun-day",
      "title": "🥯 Bolludagur",
      "summary": "Mánudagur 48 dögum fyrir páskadag; merkisdagur. Bolludagurinn er opinbert leyfi til að borða rjómabollur þar til maginn springur. Börn berja foreldra með bolluvendi – hefð sem er bæði sæt og ögn ofbeldisfull. Besti dagur ársins fyrir sælkera.",
      "body": "Bolludagur er hluti af þriggja daga röð fyrir föstu: Bolludagur, Sprengidagur og Öskudagur.\n\nÁ Íslandi tengist hann einkum rjómabollum og fjölskylduhefðum.",
      "rule": { "type": "easterOffset", "days": -48 },
      "sources": [
        { "label": "Wikipedia (IS): Bolludagur", "url": "https://is.wikipedia.org/wiki/Bolludagur" }
      ]
    },
    {
      "id": "sprengidagur",
      "title": "🍲 Sprengidagur",
      "summary": "Þriðjudagur 47 dögum fyrir páskadag. Sprengidagurinn: borða saltkjöt og baunir þar til þú getur varla hreyft þig. Nafnið er bókstaflega lýsandi – maginn „sprengist“. Fullkomin undirbúningur fyrir föstuna sem enginn heldur samt.",
      "body": "Sprengidagur er dagurinn á undan öskudegi og tengist hefð um saðningu fyrir föstu.\n\nÁ Íslandi tengist hann oft saltkjöti og baunum.",
      "rule": { "type": "easterOffset", "days": -47 },
      "sources": [
        { "label": "Wikipedia (IS): Sprengidagur", "url": "https://is.wikipedia.org/wiki/Sprengidagur" }
      ]
    },
    {
      "id": "askudagur",
      "title": "🎭 Öskudagur",
      "summary": "Miðvikudagur 46 dögum fyrir páskadag; upphaf föstu. Börn í búningum ganga milli húsa, syngja og safna sælgæti í öskupoka. Fullorðnir þykjast vera að fást við „hefð“ en eru í raun að fá ókeypis nammi. Skemmtilegasti dagurinn fyrir alla undir 12 ára (og suma yfir).",
      "body": "Öskudagur markar upphaf löngu föstu í kristinni hefð.\n\nÁ Íslandi tengist dagurinn búningum, söngvum og „öskupokum“ hjá börnum.",
      "rule": { "type": "easterOffset", "days": -46 },
      "sources": [
        { "label": "Wikipedia (IS): Öskudagur", "url": "https://is.wikipedia.org/wiki/%C3%96skudagur" }
      ]
    },
    {
      "id": "palm-sunday",
      "title": "🌿 Pálmasunnudagur",
      "summary": "Sunnudagur 7 dögum fyrir páskadag; merkisdagur í kirkjuári.",
      "body": "Pálmasunnudagur er sunnudagurinn fyrir páska og markar upphaf dymbilviku í kirkjuárinu.\n\nDagurinn er ekki lögbundinn almennur frídagur á Íslandi.",
      "rule": { "type": "easterOffset", "days": -7 },
      "sources": [
        { "label": "Wikipedia (IS): Pálmasunnudagur", "url": "https://is.wikipedia.org/wiki/P%C3%A1lmasunnudagur" }
      ]
    },
    {
      "id": "maundy-thursday",
      "title": "✝️ Skírdagur",
      "summary": "Fimmtudagur fyrir páska; minnir á síðustu kvöldmáltíðina. Lögbundinn frídagur.",
      "body": "Skírdagur er fimmtudagurinn í dymbilviku, rétt fyrir páskadag.\n\nDagurinn tengist kristinni hefð um síðustu kvöldmáltíðina og fótþvott (þar af nafnið). Á Íslandi er Skírdagur hluti af lögbundnum frídögum páskahátíðarinnar.",
      "rule": { "type": "easterOffset", "days": -3 },
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" },
        { "label": "Wikipedia (IS): Skírdagur", "url": "https://is.wikipedia.org/wiki/Sk%C3%ADrdagur" }
      ]
    },
    {
      "id": "good-friday",
      "title": "✝️ Föstudagurinn langi",
      "summary": "Föstudagur fyrir páska; minningarathöfn um krossfestingu. Lögbundinn frídagur.",
      "body": "Föstudagurinn langi er föstudagurinn í dymbilviku, tveimur dögum fyrir páskadag.\n\nÍ kristinni hefð er þetta helgur minningardagur um krossfestingu Krists. Dagurinn er lögbundinn frídagur á Íslandi.",
      "rule": { "type": "easterOffset", "days": -2 },
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" },
        { "label": "Wikipedia (IS): Föstudagurinn langi", "url": "https://is.wikipedia.org/wiki/F%C3%B6studagurinn_langi" }
      ]
    },
    {
      "id": "easter-sunday",
      "title": "🐣 Páskadagur",
      "summary": "Páskadagur; helsti hátíðisdagur kristni. Upprisan, eggjaleit og mikið súkkulaðimagn. Lögbundinn frídagur.",
      "body": "Páskadagur er helsti hátíðisdagur kristni og tengist upprisuhátíðinni.\n\nÁ Íslandi er páskadagur lögbundinn frídagur og miðpunktur páskahátíðarinnar, sem einnig nær yfir fleiri frídaga í kring.",
      "rule": { "type": "easterOffset", "days": 0 },
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" },
        { "label": "Wikipedia (IS): Páskar", "url": "https://is.wikipedia.org/wiki/P%C3%A1skar" }
      ]
    },
    {
      "id": "easter-monday",
      "title": "🐣 Annar í páskum",
      "summary": "Mánudagur eftir páskadag. Lögbundinn frídagur.",
      "body": "Annar í páskum er mánudagurinn eftir páskadag og er hluti af lögbundnum frídögum páskahátíðarinnar á Íslandi.\n\nDagurinn lengir páskahátíðina og er almennt nýttur til hvíldar og samveru.",
      "rule": { "type": "easterOffset", "days": 1 },
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" }
      ]
    },
    {
      "id": "mothers-day",
      "title": "🌷 Mæðradagurinn",
      "summary": "Annar sunnudagur í maí; merkisdagur.",
      "body": "Mæðradagurinn er haldinn annan sunnudag í maí og er tileinkaður mæðrum og uppeldi.\n\nDagurinn er merkisdagur (ekki lögbundinn frídagur).",
      "rule": { "type": "nthWeekdayOfMonth", "month": 5, "weekday": 0, "nth": 2 },
      "sources": [
        { "label": "Wikipedia (IS): Mæðradagurinn", "url": "https://is.wikipedia.org/wiki/M%C3%A6%C3%B0radagurinn" }
      ]
    },
    {
      "id": "first-day-of-summer",
      "title": "🌱 Sumardagurinn fyrsti",
      "summary": "Fyrsti fimmtudagur eftir 18. apríl. Við þykjumst fagna sumrinu þrátt fyrir að það snjói oft þennan dag. Lögbundinn frídagur fullur af bjartsýni og von um sól.",
      "body": "Sumardagurinn fyrsti á sér rætur í fornu íslensku misseristali, þar sem árinu var skipt í vetur og sumar.\n\nÁ nútímaformi er dagurinn skilgreindur sem fyrsti fimmtudagur eftir 18. apríl. Dagurinn er lögbundinn frídagur á Íslandi og tengist bæði menningarhefðum og tilfinningu fyrir árstíðaskiptum.",
      "rule": { "type": "firstThursdayAfterApril18" },
      "sources": [
        { "label": "Wikipedia (IS): Sumardagurinn fyrsti", "url": "https://is.wikipedia.org/wiki/Sumardagurinn_fyrsti" },
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" }
      ]
    },
    {
      "id": "ascension-day",
      "title": "⛪ Uppstigningardagur",
      "summary": "Fimmtudagur, 39 dögum eftir páskadag. Kristur fer upp til himins og við fáum frídag niður á jörðu.",
      "body": "Uppstigningardagur er haldinn 39 dögum eftir páskadag (alltaf á fimmtudegi).\n\nÍ kristinni hefð minnir dagurinn á uppstigningu Krists. Dagurinn er lögbundinn frídagur á Íslandi.",
      "rule": { "type": "easterOffset", "days": 39 },
      "sources": [
        { "label": "Wikipedia (IS): Uppstigningardagur", "url": "https://is.wikipedia.org/wiki/Uppstigningardagur" }
      ]
    },
    {
      "id": "fishermens-day",
      "title": "⚓ Sjómannadagurinn",
      "summary": "Helgaður sjómönnum; sérstakur frídagur sjómanna. Yfirleitt fyrsti sunnudagur í júní (með undantekningu ef hann rekst á hvítasunnu).",
      "body": "Sjómannadagurinn er helgaður íslenskum sjómönnum og þeirri sjósókn sem um aldir hefur verið ein af grunnstoðum íslensks samfélags og efnahags.\n\nDagurinn var fyrst haldinn hátíðlegur árið 1938. Með lögum nr. 20/1987 var ákveðið að fyrsti sunnudagur í júní skyldi vera formlegur frídagur sjómanna.\n\nSjómannadagurinn er því ekki almennur frídagur fyrir allt launafólk, heldur sérstakur lögbundinn frídagur sjómanna, jafnframt því að vera mikilvægur menningar- og minningardagur fyrir þjóðina.",
      "rule": { "type": "nthWeekdayOfMonth", "month": 6, "weekday": 0, "nth": 1 },
      "exceptions": [
        { "type": "avoidMoveableFeast", "feast": "pentecost", "action": { "type": "addDays", "days": 7 } }
      ],
      "sources": [
        { "label": "Alþingi: Lög nr. 20/1987 um sjómannadag", "url": "https://www.althingi.is/lagas/nuna/1987020.html" },
        { "label": "Wikipedia (IS): Sjómannadagurinn", "url": "https://is.wikipedia.org/wiki/Sj%C3%B3mannadagurinn" }
      ]
    },
    {
      "id": "pentecost",
      "title": "🕊️ Hvítasunnudagur",
      "summary": "Sunnudagur, 49 dögum eftir páskadag. Lögbundinn frídagur.",
      "body": "Hvítasunnudagur er haldinn 49 dögum eftir páskadag.\n\nÍ kristinni hefð tengist dagurinn hvítasunnu og upphafi kirkjunnar. Á Íslandi er hvítasunnudagur lögbundinn frídagur.",
      "rule": { "type": "easterOffset", "days": 49 },
      "sources": [
        { "label": "Wikipedia (IS): Hvítasunna", "url": "https://is.wikipedia.org/wiki/Hv%C3%ADtasunna" }
      ]
    },
    {
      "id": "whit-monday",
      "title": "🕊️ Annar í hvítasunnu",
      "summary": "Mánudagur eftir hvítasunnudag. Lögbundinn frídagur.",
      "body": "Annar í hvítasunnu er mánudagurinn eftir hvítasunnudag og er hluti af lögbundnum frídögum tengdum hvítasunnu á Íslandi.\n\nDagurinn er almennt nýttur til hvíldar og samveru.",
      "rule": { "type": "easterOffset", "days": 50 },
      "sources": [
        { "label": "Wikipedia (EN): Public holidays in Iceland", "url": "https://en.wikipedia.org/wiki/Public_holidays_in_Iceland" }
      ]
    },
    {
      "id": "commerce-day",
      "title": "🛍️ Frídagur verslunarmanna",
      "summary": "Fyrsti mánudagur í ágúst. Landinn streymir í blaut tjöld á rokvotri eyju, drekkur dýran bjór, hlustar á sömu lögin og þykist eiga bestu stund lífsins – áður en fólk vaknar með hausverk, tapið tjald og dansminningar við ókunnuga.",
      "body": "Frídagur verslunarmanna er haldinn fyrsta mánudag í ágúst.\n\nDagurinn tengist upphafi verslunarmannahelgarinnar og sumarfríum. Hann er lögbundinn frídagur á Íslandi og hefur lengi verið einn af helstu „langhelgardögum“ sumarsins.",
      "rule": { "type": "firstMondayOfAugust" },
      "sources": [
        { "label": "Wikipedia (IS): Verslunarmannahelgi", "url": "https://is.wikipedia.org/wiki/Verslunarmannahelgi" }
      ]
    },
    {
      "id": "reykjavik-pride",
      "title": "🏳️‍🌈 Reykjavík Pride / Gleðigangan",
      "summary": "Önnur laugardagur í ágúst; merkisdagur/viðburður (ekki lögbundinn frídagur).",
      "body": "Reykjavík Pride er árleg hátíð sem endar oft með Gleðigöngunni.\n\nDagsetningin getur verið breytileg milli ára en er oft önnur helgin í ágúst.",
      "rule": { "type": "nthWeekdayOfMonth", "month": 8, "weekday": 6, "nth": 2 },
      "sources": [
        { "label": "Wikipedia: Reykjavík Pride", "url": "https://en.wikipedia.org/wiki/Reykjav%C3%ADk_Pride" }
      ]
    },
    {
      "id": "culture-night",
      "title": "🎶 Menningarnótt í Reykjavík",
      "summary": "Fjórði laugardagur í ágúst; merkisdagur/viðburður (ekki lögbundinn frídagur).",
      "body": "Menningarnótt er árleg borgarhátíð í Reykjavík með fjölbreyttri dagskrá.\n\nDagsetningin er breytileg milli ára en fellur oft seint í ágúst.",
      "rule": { "type": "nthWeekdayOfMonth", "month": 8, "weekday": 6, "nth": 4 },
      "sources": [
        { "label": "Wikipedia (IS): Menningarnótt", "url": "https://is.wikipedia.org/wiki/Menningarn%C3%B3tt" }
      ]
    },
    {
      "id": "first-winter-day",
      "title": "❄️ Fyrsti vetrardagur",
      "summary": "Fyrsti laugardagur á eða eftir 21. október; merkisdagur úr gömlu misseristali.",
      "body": "Fyrsti vetrardagur markar upphaf vetrarmisseris í hefðbundnu íslensku misseristali.\n\nDagurinn er merkisdagur (ekki lögbundinn frídagur).",
      "rule": { "type": "weekdayOnOrAfter", "month": 10, "day": 21, "weekday": 6 },
      "sources": [
        { "label": "Wikipedia (IS): Misseri", "url": "https://is.wikipedia.org/wiki/Misseri" }
      ]
    }
  ]
}
